ARMmbed/mbed-os/targets/TARGET_NXP/TARGET_MCUXpresso_MCUS/TARGET_MIMXRT1170/drivers/fsl_pmu.h
/*******************************************************************************
 * API
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @name LDOs control related APIs
 * @{
 */

/*!
 * @brief Selects the control mode of the PLL LDO.
 *
 * @param base PMU peripheral base address.
 * @param mode The control mode of the PLL LDO. Please refer to @ref pmu_control_mode_t.
 */
void PMU_SetPllLdoControlMode(ANADIG_PMU_Type *base, pmu_control_mode_t mode);

/*!
 * @brief Switches the PLL LDO from Static/Software Mode to GPC/Hardware Mode.
 *
 * @param base PMU peripheral base address.
 */
void PMU_SwitchPllLdoToGPCMode(ANADIG_PMU_Type *base);

/*!
 * @brief Enables PLL LDO via AI interface in Static/Software mode.
 *
 * @param base PMU peripheral base address.
 */
void PMU_StaticEnablePllLdo(ANADIG_PMU_Type *base);

/*!
 * @brief Disables PLL LDO via AI interface in Static/Software mode.
 *
 * @param base PMU peripheral base address.
 */
void PMU_StaticDisablePllLdo(void);

/*!
 * @brief Selects the control mode of the LPSR ANA LDO.
 *
 * @param base PMU peripheral base address.
 * @param mode The control mode of the LPSR ANA LDO. Please refer to @ref pmu_control_mode_t.
 */
void PMU_SetLpsrAnaLdoControlMode(ANADIG_LDO_SNVS_Type *base, pmu_control_mode_t mode);

/*!
 * @brief Sets the Bypass mode of the LPSR ANA LDO.
 *
 * @param base ANADIG_LDO_SNVS peripheral base address.
 * @param bypassMode The Bypass mode of LPSR ANA LDO. Please refer to @ref pmu_lpsr_ana_ldo_bypass_mode_t.
 */
void PMU_StaticSetLpsrAnaLdoBypassMode(ANADIG_LDO_SNVS_Type *base, pmu_lpsr_ana_ldo_bypass_mode_t bypassMode);

/*!
 * @brief Fill the LPSR ANA LDO configuration structure with default settings.
 *
 * The default values are:
 * @code
 *      config->mode                   = kPMU_HighPowerMode;
        config->enable2mALoad          = true;
        config->enable20uALoad         = false;
        config->enable4mALoad          = true;
        config->enableStandbyMode      = false;
        config->driverStrength         = kPMU_LpsrAnaLdoDriverStrength0;
        config->brownOutDetectorConfig = kPMU_LpsrAnaLdoBrownOutDetectorDisable;
        config->chargePumpCurrent      = kPMU_LpsrAnaChargePump300nA;
        config->outputRange            = kPMU_LpsrAnaLdoOutputFrom1P77To1P83;
 * @endcode
 *
 * @param config Pointer to the structure @ref pmu_static_lpsr_ana_ldo_config_t.
 */
void PMU_StaticGetLpsrAnaLdoDefaultConfig(pmu_static_lpsr_ana_ldo_config_t *config);

/*!
 * @brief Initialize the LPSR ANA LDO in Static/Sofware Mode.
 *
 * @param base ANADIG_LDO_SNVS peripheral base address.
 * @param config Pointer to the structure @ref pmu_static_lpsr_ana_ldo_config_t.
 */
void PMU_StaticLpsrAnaLdoInit(ANADIG_LDO_SNVS_Type *base, const pmu_static_lpsr_ana_ldo_config_t *config);

/*!
 * @brief Disable the output of LPSR ANA LDO.
 *
 * @param base ANADIG_LDO_SNVS peripheral base address.
 */
void PMU_StaticLpsrAnaLdoDeinit(ANADIG_LDO_SNVS_Type *base);

/*!
 * @brief Selects the control mode of the LPSR DIG LDO.
 *
 * @param base PMU peripheral base address.
 * @param mode The control mode of the LPSR DIG LDO. Please refer to @ref pmu_control_mode_t.
 */
void PMU_SetLpsrDigLdoControlMode(ANADIG_LDO_SNVS_Type *base, pmu_control_mode_t mode);

/*!
 * @brief Turn on/off Bypass mode of the LPSR DIG LDO in Static/Software mode.
 *
 * @param base ANADIG_LDO_SNVS peripheral base address.
 * @param enable
 *               - @b true Turns on Bypass mode of the LPSR DIG LDO.
 *               - @b false Turns off Bypass mode of the LPSR DIG LDO.
 */
void PMU_StaticEnableLpsrDigLdoBypassMode(ANADIG_LDO_SNVS_Type *base, bool enable);

/*!
 * @brief Gets the default configuration of LPSR DIG LDO.
 *
 * The default values are:
 *  @code
 *          config->enableStableDetect = false;
 *          config->voltageStepTime    = kPMU_LpsrDigVoltageStepInc50us;
 *          config->brownOutConfig     = kPMU_LpsrDigBrownOutDisable;
 *          config->targetVoltage      = kPMU_LpsrDigTargetStableVoltage1P0V;
 *          config->mode               = kPMU_HighPowerMode;
 *  @endcode
 * @param config Pointer to the structure @ref pmu_static_lpsr_dig_config_t.
 */
void PMU_StaticGetLpsrDigLdoDefaultConfig(pmu_static_lpsr_dig_config_t *config);

/*!
 * @brief Initialize the LPSR DIG LDO in static mode.
 *
 * @param base ANADIG_LDO_SNVS peripheral base address.
 * @param config Pointer to the structure @ref pmu_static_lpsr_dig_config_t.
 */
void PMU_StaticLpsrDigLdoInit(ANADIG_LDO_SNVS_Type *base, const pmu_static_lpsr_dig_config_t *config);

/*!
 * @brief Disable the LPSR DIG LDO.
 *
 * @param base ANADIG_LDO_SNVS peripheral base address.
 */
void PMU_StaticLpsrDigLdoDeinit(ANADIG_LDO_SNVS_Type *base);

/*!
 * @brief Sets the voltage step of LPSR DIG LDO in certain setpoint during GPC mode.
 *
 * @note The function provides the feature to set the voltage step to different setpoints.
 *
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param voltageValue The voltage step to be set. See enumeration @ref pmu_lpsr_dig_target_output_voltage_t.
 */
void PMU_GPCSetLpsrDigLdoTargetVoltage(uint32_t setpointMap, pmu_lpsr_dig_target_output_voltage_t voltageValue);

/*!
 * @brief Gets the default config of the SNVS DIG LDO.
 *
 * The default values are:
 *  @code
 *      config->mode                   = kPMU_LowPowerMode;
 *      config->chargePumpCurrent      = kPMU_SnvsDigChargePump12P5nA;
 *      config->dischargeResistorValue = kPMU_SnvsDigDischargeResistor15K;
 *      config->trimValue              = 0U;
 *      config->enablePullDown         = true;
 *      config->enableLdoStable        = false;
 *  @endcode
 *
 * @param config Pointer to @ref structure pmu_snvs_dig_config_t.
 */
void PMU_GetSnvsDigLdoDefaultConfig(pmu_snvs_dig_config_t *config);

/*!
 * @brief Initialize the SNVS DIG LDO.
 *
 * @param base LDO SNVS DIG peripheral base address.
 * @param config Pointer to structure @ref pmu_snvs_dig_config_t.
 */
void PMU_SnvsDigLdoInit(ANADIG_LDO_SNVS_DIG_Type *base, const pmu_snvs_dig_config_t *config);

/*!
 * @brief Disable SNVS DIG LDO.
 */
static inline void PMU_SnvsDigLdoDeinit(ANADIG_LDO_SNVS_DIG_Type *base)
{
    base->PMU_LDO_SNVS_DIG &= ~ANADIG_LDO_SNVS_DIG_PMU_LDO_SNVS_DIG_REG_EN_MASK;
}

/*!
 * @brief  Controls the ON/OFF of the selected LDO in certain setpoints with GPC mode.
 *
 * @param name The name of the selected ldo. Please see enumeration @ref pmu_ldo_name_t for details.
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param enable Turn on/off the LDO.
 *               - @b true Turns on the selected LDO in certain setpoints.
 *               - @b false Turns off the selected LDO in certain setpoints.
 */
void PMU_GPCEnableLdo(pmu_ldo_name_t name, uint32_t setpointMap, bool enable);

/*!
 * @brief Sets the operating mode of the selected LDO in certain setpoints with GPC mode.
 *
 * @param name The name of the selected ldo. Please see enumeration @ref pmu_ldo_name_t for details.
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param mode The operating mode of the selected ldo. Please refer to enumeration @ref pmu_ldo_operate_mode_t for
 * details.
 */
void PMU_GPCSetLdoOperateMode(pmu_ldo_name_t name, uint32_t setpointMap, pmu_ldo_operate_mode_t mode);

/*!
 * @brief Controls the ON/OFF of the selected LDOs' Tracking mode in certain setpoints with GPC mode.
 *
 * @param name The name of the selected ldo. Please see enumeration @ref pmu_ldo_name_t for details.
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param enable Turn on/off the LDOs' Tracking mode.
 *               - @b true Turns on the selected LDO's tracking mode in certain setpoints.
 *               - @b false Turns off the selected LDO's tracking mode in certain setpoints.
 */
void PMU_GPCEnableLdoTrackingMode(pmu_ldo_name_t name, uint32_t setpointMap, bool enable);

/*!
 * @brief Controls the ON/OFF of the selected LDOs' Bypass mode in certain setpoints with GPC mode.
 *
 * @param name The name of the selected ldo. Please see enumeration @ref pmu_ldo_name_t for details.
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param enable Turn on/off the LDOs' Bypass mode.
 *               - @b true Turns on the selected LDO's Bypass mode in certain setpoints.
 *               - @b false Turns off the selected LDO's Bypass mode in certain setpoints.
 */
void PMU_GPCEnableLdoBypassMode(pmu_ldo_name_t name, uint32_t setpointMap, bool enable);

/*!
 * @brief Controls the ON/OFF of the selected LDOs' Standby mode in certain setpoints with GPC mode.
 *
 * @param name The name of the selected ldo. Please see enumeration @ref pmu_ldo_name_t for details.
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param enable Turn on/off the LDOs' Standby mode.
 *               - @b true Turns on the selected LDO's Standby mode in the certain setpoints.
 *               - @b false Turns off the selected LDO's Standby mode in the certain setpoints.
 */
void PMU_GPCEnableLdoStandbyMode(pmu_ldo_name_t name, uint32_t setpointMap, bool enable);

/*!
 * @}
 */

/*!
 * @name Bandgap control related APIs
 * @{
 */

/*!
 * @brief Selects the control mode of the Bandgap Reference.
 *
 * @param base PMU peripheral base address.
 * @param mode The control mode of the Bandgap Reference. Please refer to @ref pmu_control_mode_t.
 */
void PMU_SetBandgapControlMode(ANADIG_PMU_Type *base, pmu_control_mode_t mode);

/*!
 * @brief Switches the Bandgap from Static/Software Mode to GPC/Hardware Mode.
 *
 * @param base PMU peripheral base address.
 */
void PMU_SwitchBandgapToGPCMode(ANADIG_PMU_Type *base);

/*!
 * @brief Disables Bandgap self bias for best noise performance.
 *
 * This function should be invoked after powering up. This function will wait for the bandgap stable and disable the
 * bandgap self bias. After powering up, it need to wait for the bandgap to get stable and then disable Bandgap Self
 * bias for best noise performance.
 */
void PMU_DisableBandgapSelfBiasAfterPowerUp(void);

/*!
 * @brief Enables Bandgap self bias before power down.
 *
 * This function will enable Bandgap self bias feature before powering down or there
 * will be risk of Bandgap not starting properly.
 */
void PMU_EnableBandgapSelfBiasBeforePowerDown(void);

/*!
 * @brief Initialize Bandgap.
 *
 * @param config Pointer to the structure @ref pmu_static_bandgap_config_t.
 */
void PMU_StaticBandgapInit(const pmu_static_bandgap_config_t *config);

/*!
 * @brief Controls the ON/OFF of the Bandgap in certain setpoints with GPC mode.
 *
 * @param base PMU peripheral base address.
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param enable Turn on/off the Bandgap.
 *               - @b true Turns on the Bandgap in certain setpoints.
 *               - @b false Turns off the Bandgap in certain setpoints.
 */
static inline void PMU_GPCEnableBandgap(ANADIG_PMU_Type *base, uint32_t setpointMap, bool enable)
{
    if (enable)
    {
        base->BANDGAP_ENABLE_SP &= ~setpointMap;
    }
    else
    {
        base->BANDGAP_ENABLE_SP |= setpointMap;
    }
}

/*!
 * @brief Controls the ON/OFF of the Bandgap's Standby mode in certain setpoints with GPC mode.
 *
 * @param base PMU peripheral base address.
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param enable Turn on/off the Bandgap's Standby mode.
 *               - @b true Turns on the Bandgap's Standby mode in certain setpoints.
 *               - @b false Turns off the Bandgap's Standby mode in certain setpoints.
 */
static inline void PMU_GPCEnableBandgapStandbyMode(ANADIG_PMU_Type *base, uint32_t setpointMap, bool enable)
{
    if (enable)
    {
        base->BANDGAP_STBY_EN_SP |= setpointMap;
    }
    else
    {
        base->BANDGAP_STBY_EN_SP &= ~setpointMap;
    }
}

/*!
 * @}
 */

/*!
 * @name Body Bias control
 * @{
 */

/*!
 * @brief Selects the control mode of the Body Bias.
 *
 * @param base PMU peripheral base address.
 * @param name The name of the body bias. Please refer to @ref pmu_body_bias_name_t.
 * @param mode The control mode of the Body Bias. Please refer to @ref pmu_control_mode_t.
 */
void PMU_SetBodyBiasControlMode(ANADIG_PMU_Type *base, pmu_body_bias_name_t name, pmu_control_mode_t mode);

/*!
 * @brief Gets the default config of CM7 Forward Body Bias in Static/Software mode.
 *
 * @param config Pointer to the structure @ref pmu_static_body_bias_config_t.
 */
void PMU_StaticGetCm7FBBDefaultConfig(pmu_static_body_bias_config_t *config);

/*!
 * @brief Initialize CM7 Forward Body Bias in Static/Software Mode.
 *
 * @param base PMU peripheral base address.
 * @param config Pointer to the structure @ref pmu_static_body_bias_config_t.
 */
void PMU_StaticCm7FBBInit(ANADIG_PMU_Type *base, const pmu_static_body_bias_config_t *config);

/*!
 * @brief Gets the default config of LPSR Reverse Body Bias in Static/Software mode.
 *
 * @param config Pointer to the structure @ref pmu_static_body_bias_config_t.
 */
void PMU_StaticLpsrRBBDefaultConfig(pmu_static_body_bias_config_t *config);

/*!
 * @brief Initialize LPSR Reverse Body Bias in Static/Software Mode.
 *
 * @param base PMU peripheral base address.
 * @param config Pointer to the structure @ref pmu_static_body_bias_config_t.
 */
void PMU_StaticLpsrRBBInit(ANADIG_PMU_Type *base, const pmu_static_body_bias_config_t *config);

/*!
 * @brief Gets the default config of SOC Reverse Body Bias in Static/Software mode.
 *
 * @param config Pointer to the structure @ref pmu_static_body_bias_config_t.
 */
void PMU_StaticSocRBBDefaultConfig(pmu_static_body_bias_config_t *config);

/*!
 * @brief Initialize SOC Reverse Body Bias in Static/Software Mode.
 *
 * @param base PMU peripheral base address.
 * @param config Pointer to the structure @ref pmu_static_body_bias_config_t.
 */
void PMU_StaticSocRBBInit(ANADIG_PMU_Type *base, const pmu_static_body_bias_config_t *config);

/*!
 * @brief  Controls the ON/OFF of the selected body bias in certain setpoints with GPC mode.
 *
 * @param name The name of the selected body bias. Please see enumeration @ref pmu_body_bias_name_t for details.
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param enable Turn on/off the body bias.
 *               - @b true Turns on the selected body bias in certain setpoints.
 *               - @b false Turns off the selected body bias in certain setpoints.
 */
void PMU_GPCEnableBodyBias(pmu_body_bias_name_t name, uint32_t setpointMap, bool enable);

/*!
 * @brief Controls the ON/OFF of the selected Body Bias' Standby mode in certain setpoints with GPC mode.
 *
 * @param name The name of the selected body bias. Please see the enumeration @ref pmu_body_bias_name_t for details.
 * @param setpointMap The map of setpoints should be the OR'ed Value of @ref _pmu_setpoint_map.
 * @param enable Turn on/off the body bias' Standby mode.
 *               - @b true Turns on the selected body bias' Standby mode in certain setpoints.
 *               - @b false Turns off the selected body bias' Standby mode in certain setpoints.
 */
void PMU_GPCEnableBodyBiasStandbyMode(pmu_body_bias_name_t name, uint32_t setpointMap, bool enable);

/*!
 * @brief Gets the default config of body bias in GPC mode.
 *
 * @param config Pointer to structure @ref pmu_gpc_body_bias_config_t.
 */
void PMU_GPCGetBodyBiasDefaultConfig(pmu_gpc_body_bias_config_t *config);

/*!
 * @brief Sets the config of the selected Body Bias in GPC mode.
 *
 * @param name The name of the selected body bias. Please see enumeration @ref pmu_body_bias_name_t for details.
 * @param config Pointer to structure @ref pmu_gpc_body_bias_config_t.
 */
void PMU_GPCSetBodyBiasConfig(pmu_body_bias_name_t name, const pmu_gpc_body_bias_config_t *config);

/*!
 * @}
 */

#if defined(__cplusplus)
}
#endif
/*!
 * @}
 */

#endif /* _FSL_PMU_H_ */
